Repository: carlosypunto/SearchKit
Catalog: SearchKitExample/SearchKitExample/Localizable.xcstrings
Source language: en
Languages: es

source: %@ · fragment %lld · %@
es: %1$@ · fragmento %2$lld · %3$@

source: %lld indexed fragments
es: %lld fragmentos indexados

source: %lld of %lld
es: %lld de %lld

source: %lld results
es: %lld resultados

source: All
es: Cualquiera

source: Auto
es: Automático

source: Changing the metric rebuilds the entire index (re-embedding the corpus).
es: Cambiar la métrica reconstruye todo el índice (recalculando los embeddings del corpus).

source: Cosine
es: Coseno

source: Degraded mode: lexical search only (embedding not available)
es: Modo degradado: solo búsqueda léxica (embedding no disponible)

source: Degraded mode: semantic search only
es: Modo degradado: solo búsqueda semántica

source: Deletes the search index and rebuilds it from the bundled corpus.
es: Elimina el índice de búsqueda y lo reconstruye a partir del corpus incluido.

source: distance %@
es: distancia %@

source: Distance Metric
es: Métrica de distancia

source: Document Search
es: Búsqueda de documentos

source: Done
es: Hecho

source: e.g., how to avoid data races
es: p. ej. cómo evitar data races

source: English
es: Inglés

source: Enter a query in natural language, in Spanish or English.
es: Escribe una consulta en lenguaje natural, en español o en inglés.

source: Expands to show the full RAG prompt built from this result.
es: Muestra el prompt RAG completo construido a partir de este resultado.

source: Family
es: Familia

source: Filters
es: Filtros

source: Forced mode: %@
es: Modo forzado: %@

source: Hybrid
es: Híbrido

source: hybrid (RRF)
es: híbrido (RRF)

source: Index unavailable
es: Índice no disponible

source: Indexing documents
es: Indexando documentos

source: Indexing documents… %lld/%lld
es: Indexando documentos… %lld/%lld

source: L2 (euclidean)
es: L2 (euclídea)

source: Language
es: Idioma

source: Max results
es: Resultados máximos

source: Mode
es: Modo

source: Options
es: Opciones

source: Preparing index…
es: Preparando el índice…

source: Prompt improved by RAG
es: Prompt mejorado con RAG

source: Reindex
es: Reindexar

source: Result
es: Resultado

source: Retrieval
es: Recuperación

source: Retry
es: Reintentar

source: score %@
es: puntuación %@

source: score RRF %@
es: puntuación RRF %@

source: Search Options
es: Opciones de búsqueda

source: Spanish
es: Español

source: Text
es: Texto

source: text (BM25)
es: texto (BM25)

source: The query does not contain any searchable terms for the selected mode.
es: La consulta no contiene términos buscables para el modo seleccionado.

source: Vector
es: Vectorial

source: vector
es: vectorial
